Date Time handle:-

As we know that date and time are always in string and object form(type).

So first we need to convert them in datetime data type. then we can extact day, time, year days etc.

First, make sure your column is datetime type:
df['date'] = pd.to_datetime(df['date'])


1. Filter by Year
df[df['date'].dt.year == 2024]

üîπ 2. Filter by Month
df[df['date'].dt.month == 1]   # January

üîπ 3. Filter by Day
df[df['date'].dt.day == 15]

üîπ 4. Filter by Day of Week
df[df['date'].dt.dayofweek == 0]   # Monday = 0

or
df[df['date'].dt.day_name() == 'Monday']

üîπ 5. Filter by Quarter
df[df['date'].dt.quarter == 2]


üîπ 6. Filter by Specific Date Range
df[(df['date'] >= '2024-01-01') & (df['date'] <= '2024-03-31')]

OR

df[df['date'].between('2024-01-01', '2024-03-31')]

üîπ 7. Filter by Hour (if timestamp)
df[df['date'].dt.hour == 14]



üîπ 8. Other Useful Date Attributes
Attribute:-	Meaning
.dt.year:-	Year
.dt.month:-	Month (1‚Äì12)
.dt.day:- 	Day of month
.dt.dayofweek:-	0=Mon, 6=Sun
.dt.weekday:-	Same as dayofweek
.dt.week:-	Week number (deprecated ‚Üí use .dt.isocalendar().week)
.dt.quarter:-	Quarter (1‚Äì4)
.dt.hour:-	Hour
.dt.minute:-	Minute
.dt.second:-	Second
.dt.is_month_end:-	True if month end
.dt.is_month_start:-	True if month start

In [ ]:
import numpy as np
import pandas as pd

#using 2 different data
date = pd.read_csv('data/orders.csv')
time = pd.read_csv('data/messages.csv')

date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           –∏—â—É –Ω–∞ —Å–µ–≥–æ–¥–Ω—è –º—É–∂–∏–∫–∞ 37
1  2014-04-29 23:40:00   –ü–ê–†–ï–ù–¨ –ë–ò –ò–©–ï–¢ –î–†–£–ì–ê –°–ï–ô–ß–ê–°!! –°–ú–° –ú–ú–° 0955532826
2  2012-12-30 00:21:00           –î–Ω–µ–ø—Ä.–º 43 –ø–æ–∑–Ω.—Å –¥/–∂ *.–æ  067.16.34.576
3  2014-11-28 00:31:00  –ö–ò–ï–í –ò–©–£ –î/–ñ –î–û 45 –ú–ù–ï –°–ï–ô–ß–ê–° –°–ö–£–ß–ù–û 093 629 9...
4  2013-10-26 23:11:00    –ó–∞—è —è —Ç–µ–±—è –Ω–∏–∫–æ–≥–¥–∞ –Ω–µ –æ–±–∏–∂—É  –ª—é–±–ª—é —Ç–µ–±—è!)  –î–∞—à–µ

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

### Working with Dates

In [8]:
# first convert datatype to date time
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

### 1. Extract year

In [9]:
date['date_year'] = date['date'].dt.year

date.sample(5)

          date  product_id  city_id  orders  date_year
728 2019-11-07        6531       26       1       2019
303 2019-06-01        1069       27       7       2019
114 2019-11-28        6534       14       2       2019
365 2018-07-18        6248        4       2       2018
151 2019-10-15        5066       18      14       2019

### 2. Extract Month

In [10]:
date['date_month_no'] = date['date'].dt.month

date.head()

        date  product_id  city_id  orders  date_year  date_month_no
0 2019-12-10        5628       25       3       2019             12
1 2018-08-15        3646       14     157       2018              8
2 2018-10-23        1859       25       1       2018             10
3 2019-08-17        7292       25       1       2019              8
4 2019-01-06        4344       25       3       2019              1

In [11]:
date['date_month_name'] = date['date'].dt.month_name()

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

### Extract Days

In [12]:
date['date_day'] = date['date'].dt.day

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

# day of week

In [13]:
date['date_dow'] = date['date'].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

# day of week - name

In [14]:
date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

# is weekend?

In [15]:

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

### #Extract week of the year

In [17]:
date['date_week'] = date['date'].dt.isocalendar().week

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

### Extract Quarter

In [18]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

### Extract Semester

In [19]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

### Extract Time elapsed between dates

In [20]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2026, 2, 13, 15, 8, 14, 561886)

In [21]:
today - date['date']

0     2257 days 15:08:14.561886
1     2739 days 15:08:14.561886
2     2670 days 15:08:14.561886
3     2372 days 15:08:14.561886
4     2595 days 15:08:14.561886
                 ...
995   2685 days 15:08:14.561886
996   2626 days 15:08:14.561886
997   2474 days 15:08:14.561886
998   2539 days 15:08:14.561886
999   2313 days 15:08:14.561886
Name: date, Length: 1000, dtype: timedelta64[ns]

In [22]:
(today - date['date']).dt.days

0      2257
1      2739
2      2670
3      2372
4      2595
       ...
995    2685
996    2626
997    2474
998    2539
999    2313
Name: date, Length: 1000, dtype: int64

### # Months passed

In [25]:
date['month_diff'] = (
    (today.year - date['date'].dt.year) * 12 +
    (today.month - date['date'].dt.month)
).astype(int)

### Time difference